const towns = [
	{
		region: "Москва",
		town: "Москва",
	},
	{
		region: "Санкт-Петербург",
		town: "Санкт-Петербург",
	},
	{
		region: "Новосибирская область",
		town: "Новосибирск",
	},
	{
		region: "Свердловская область",
		town: "Екатеринбург",
	},
	{
		region: "Республика Татарстан",
		town: "Казань",
	},
	{
		region: "Нижегородская область",
		town: "Нижний Новгород",
	},
	{
		region: "Челябинская область",
		town: "Челябинск",
	},
	{
		region: "Омская область",
		town: "Омск",
	},
	{
		region: "Ростовская область",
		town: "Ростов-На-Дону",
	},
	{
		region: "Республика Башкортостан",
		town: "Уфа",
	},
	{
		region: "Красноярский край",
		town: "Красноярск",
	},
	{
		region: "Пермский край",
		town: "Пермь",
	},
	{
		region: "Воронежская область",
		town: "Воронеж",
	},
	{
		region: "Волгоградская область",
		town: "Волгоград",
	},
	{
		region: "Самарская область",
		town: "Самара",
	},
	{
		region: "Саратовская область",
		town: "Саратов",
	},
	{
		region: "Тюменская область",
		town: "Тюмень",
	},
	{
		region: "Самарская область",
		town: "Тольятти",
	},
	{
		region: "Удмуртская Республика",
		town: "Ижевск",
	},
	{
		region: "Алтайский край",
		town: "Барнаул",
	},
	{
		region: "Иркутская область",
		town: "Иркутск",
	},
	{
		region: "Ульяновская область",
		town: "Ульяновск",
	},
	{
		region: "Хабаровский край",
		town: "Хабаровск",
	},
	{
		region: "Ярославская область",
		town: "Ярославль",
	},
	{
		region: "Приморский край",
		town: "Владивосток",
	},
	{
		region: "Республика Дагестан",
		town: "Махачкала",
	},
	{
		region: "Томская область",
		town: "Томск",
	},
	{
		region: "Оренбургская область",
		town: "Оренбург",
	},
	{
		region: "Кемеровская область",
		town: "Кемерово",
	},
	{
		region: "Кемеровская область",
		town: "Новокузнецк",
	},
	{
		region: "Рязанская область",
		town: "Рязань",
	},
	{
		region: "Астраханская область",
		town: "Астрахань",
	},
	{
		region: "Республика Татарстан",
		town: "Набережные Челны",
	},
	{
		region: "Пензенская область",
		town: "Пенза",
	},
	{
		region: "Липецкая область",
		town: "Липецк",
	},
	{
		region: "Кировская область",
		town: "Киров",
	},
	{
		region: "Тульская область",
		town: "Тула",
	},
	{
		region: "Чувашская Республика",
		town: "Чебоксары",
	},
	{
		region: "Калининградская область",
		town: "Калининград",
	},
	{
		region: "Курская область",
		town: "Курск",
	},
	{
		region: "Республика Бурятия",
		town: "Улан-Удэ",
	},
	{
		region: "Ставропольский край",
		town: "Ставрополь",
	},
	{
		region: "Московская область",
		town: "Балашиха",
	},
	{
		region: "Челябинская область",
		town: "Магнитогорск",
	},
	{
		region: "Тверская область",
		town: "Тверь",
	},
	{
		region: "Севастополь",
		town: "Севастополь",
	},
	{
		region: "Ивановская область",
		town: "Иваново",
	},
	{
		region: "Брянская область",
		town: "Брянск",
	},
	{
		region: "Краснодарский край",
		town: "Сочи",
	},
	{
		region: "Белгородская область",
		town: "Белгород",
	},

	{
		region: "Свердловская область",
		town: "Нижний Тагил",
	},
	{
		region: "Владимирская область",
		town: "Владимир",
	},
	{
		region: "Архангельская область",
		town: "Архангельск",
	},
	{
		region: "Ханты-Мансийский автономный округ",
		town: "Сургут",
	},
	{
		region: "Забайкальский край",
		town: "Чита",
	},
	{
		region: "Калужская область",
		town: "Калуга",
	},
	{
		region: "Республика Крым",
		town: "Симферополь",
	},
	{
		region: "Смоленская область",
		town: "Смоленск",
	},
	{
		region: "Волгоградская область",
		town: "Волжский",
	},
	{
		region: "Курганская область",
		town: "Курган",
	},
	{
		region: "Орловская область",
		town: "Орёл",
	},
	{
		region: "Вологодская область",
		town: "Череповец",
	},
	{
		region: "Вологодская область",
		town: "Вологда",
	},
	{
		region: "Республика Мордовия",
		town: "Саранск",
	},
	{
		region: "Северная Осетия",
		town: "Владикавказ",
	},
	{
		region: "Республика Саха",
		town: "Якутск",
	},
	{
		region: "Мурманская область",
		town: "Мурманск",
	},
	{
		region: "Московская область",
		town: "Подольск",
	},

	{
		region: "Тамбовская область",
		town: "Тамбов",
	},
	{
		region: "Чеченская Республика",
		town: "Грозный",
	},
	{
		region: "Республика Башкортостан",
		town: "Стерлитамак",
	},
	{
		region: "Республика Карелия",
		town: "Петрозаводск",
	},
	{
		region: "Костромская область",
		town: "Кострома",
	},
	{
		region: "Ханты-Мансийский автономный округ",
		town: "Нижневартовск",
	},
	{
		region: "Краснодарский край",
		town: "Новороссийск",
	},
	{
		region: "Республика Марий Эл",
		town: "Йошкар-Ола",
	},
	{
		region: "Хабаровский край",
		town: "Комсомольск-на-Амуре",
	},
	{
		region: "Ростовская область",
		town: "Таганрог",
	},
	{
		region: "Республика Коми",
		town: "Сыктывкар",
	},
	{
		region: "Московская область",
		town: "Химки",
	},
	{
		region: "Кабардино-Балкария",
		town: "Нальчик",
	},
	{
		region: "Ростовская область",
		town: "Шахты",
	},
	{
		region: "Республика Татарстан",
		town: "Нижнекамск",
	},
	{
		region: "Иркутская область",
		town: "Братск",
	},
	{
		region: "Нижегородская область",
		town: "Дзержинск",
	},
	{
		region: "Оренбургская область",
		town: "Орск",
	},
	{
		region: "Иркутская область",
		town: "Ангарск",
	},
	{
		region: "Амурская область",
		town: "Благовещенск",
	},
	{
		region: "Саратовская область",
		town: "Энгельс",
	},
	{
		region: "Белгородская область",
		town: "Старый Оскол",
	},
	{
		region: "Новгородская область",
		town: "Великий Новгород",
	},
	{
		region: "Московская область",
		town: "Королёв",
	},
	{
		region: "Псковская область",
		town: "Псков",
	},
	{
		region: "Алтайский край",
		town: "Бийск",
	},
	{
		region: "Московская область",
		town: "Мытищи",
	},
	{
		region: "Кемеровская область",
		town: "Прокопьевск",
	},
	{
		region: "Сахалинская область",
		town: "Южно-Сахалинск",
	},
	{
		region: "Саратовская область",
		town: "Балаково",
	},
	{
		region: "Ярославская область",
		town: "Рыбинск",
	},
	{
		region: "Краснодарский край",
		town: "Армавир",
	},
	{
		region: "Московская область",
		town: "Люберцы",
	},
	{
		region: "Архангельская область",
		town: "Северодвинск",
	},
	{
		region: "Камчатский край",
		town: "Петропавловск-Камчатский",
	},
	{
		region: "Республика Хакасия",
		town: "Абакан",
	},
	{
		region: "Красноярский край",
		town: "Норильск",
	},
	{
		region: "Самарская область",
		town: "Сызрань",
	},
	{
		region: "Ростовская область",
		town: "Волгодонск",
	},
	{
		region: "Ростовская область",
		town: "Новочеркасск",
	},
	{
		region: "Свердловская область",
		town: "Каменск-Уральский",
	},
	{
		region: "Челябинская область",
		town: "Златоуст",
	},
	{
		region: "Приморский край",
		town: "Уссурийск",
	},
	{
		region: "Московская область",
		town: "Электросталь",
	},
	{
		region: "Республика Башкортостан",
		town: "Салават",
	},
	{
		region: "Приморский край",
		town: "Находка",
	},
	{
		region: "Республика Татарстан",
		town: "Альметьевск",
	},
	{
		region: "Челябинская область",
		town: "Миасс",
	},
	{
		region: "Республика Крым",
		town: "Керчь",
	},
	{
		region: "Пермский край",
		town: "Березники",
	},
	{
		region: "Алтайский край",
		town: "Рубцовск",
	},
	{
		region: "Челябинская область",
		town: "Копейск",
	},
	{
		region: "Ставропольский край",
		town: "Пятигорск",
	},
	{
		region: "Московская область",
		town: "Красногорск",
	},
	{
		region: "Республика Адыгея",
		town: "Майкоп",
	},
	{
		region: "Московская область",
		town: "Коломна",
	},
	{
		region: "Московская область",
		town: "Одинцово",
	},
	{
		region: "Владимирская область",
		town: "Ковров",
	},
	{
		region: "Республика Дагестан",
		town: "Хасавюрт",
	},
	{
		region: "Ставропольский край",
		town: "Кисловодск",
	},
	{
		region: "Московская область",
		town: "Серпухов",
	},
	{
		region: "Тульская область",
		town: "Новомосковск",
	},
	{
		region: "Республика Башкортостан",
		town: "Нефтекамск",
	},
	{
		region: "Чувашская Республика",
		town: "Новочебоксарск",
	},
	{
		region: "Ханты-Мансийский автономный округ",
		town: "Нефтеюганск",
	},
	{
		region: "Свердловская область",
		town: "Первоуральск",
	},
	{
		region: "Московская область",
		town: "Щёлково",
	},
	{
		region: "Карачаево-Черкесия",
		town: "Черкесск",
	},
	{
		region: "Республика Дагестан",
		town: "Дербент",
	},
	{
		region: "Ростовская область",
		town: "Батайск",
	},
	{
		region: "Московская область",
		town: "Орехово-Зуево",
	},
	{
		region: "Ставропольский край",
		town: "Невинномысск",
	},
	{
		region: "Московская область",
		town: "Домодедово",
	},
	{
		region: "Ульяновская область",
		town: "Димитровград",
	},

	{
		region: "Республика Тыва",
		town: "Кызыл",
	},
	{
		region: "Республика Башкортостан",
		town: "Октябрьский",
	},
	{
		region: "Республика Ингушетия",
		town: "Назрань",
	},
	{
		region: "Волгоградская область",
		town: "Камышин",
	},
	{
		region: "Калужская область",
		town: "Обнинск",
	},
	{
		region: "Ямало-Ненецкий автономный округ",
		town: "Новый Уренгой",
	},
	{
		region: "Республика Дагестан",
		town: "Каспийск",
	},
	{
		region: "Владимирская область",
		town: "Муром",
	},
	{
		region: "Московская область",
		town: "Раменское",
	},
	{
		region: "Ростовская область",
		town: "Новошахтинск",
	},
	{
		region: "Московская область",
		town: "Жуковский",
	},
	{
		region: "Томская область",
		town: "Северск",
	},
	{
		region: "Московская область",
		town: "Пушкино",
	},
	{
		region: "Ямало-Ненецкий автономный округ",
		town: "Ноябрьск",
	},
	{
		region: "Республика Крым",
		town: "Евпатория",
	},
	{
		region: "Ставропольский край",
		town: "Ессентуки",
	},
	{
		region: "Липецкая область",
		town: "Елец",
	},
	{
		region: "Красноярский край",
		town: "Ачинск",
	},
	{
		region: "Приморский край",
		town: "Артём",
	},
	{
		region: "Московская область",
		town: "Сергиев Посад",
	},
	{
		region: "Нижегородская область",
		town: "Арзамас",
	},
	{
		region: "Республика Калмыкия",
		town: "Элиста",
	},
	{
		region: "Самарская область",
		town: "Новокуйбышевск",
	},
	{
		region: "Новосибирская область",
		town: "Бердск",
	},
	{
		region: "Московская область",
		town: "Ногинск",
	},
	{
		region: "Московская область",
		town: "Долгопрудный",
	},
	{
		region: "Курская область",
		town: "Железногорск",
	},
	{
		region: "Ханты-Мансийский автономный округ",
		town: "Ханты-Мансийск",
	},
	{
		region: "Магаданская область",
		town: "Магадан",
	},
	{
		region: "Ямало-Ненецкий автономный округ",
		town: "Салехард",
	},
	{
		region: "Чукотский автономный округ",
		town: "Анадырь",
	},
	{
		region: "Еврейская автономная область",
		town: "Биробиджан",
	},
	{
		region: "Республика Алтай",
		town: "Горно-Алтайск",
	},
	{
		region: "Республика Ингушетия",
		town: "Магас",
	},
	{
		region: "Ненецкий автономный округ",
		town: "Нарьян-Мар",
	},
];

export const townsData = towns
	.sort((a, b) => (a.region < b.region ? 0 : -1))
	.sort((a, b) => (a.region === b.region && a.town > b.town ? 0 : -1))
	.map((value) => `${value.region}, ${value.town}`);
